app/Controllers/AlunosController.php

SELECT *
FROM `s_alunos`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `s_alunos`
---
    public function lista_alunos()
    {
        echo view('templates/header');
        echo view('templates/nav');
        $db      = \Config\Database::connect();
        $builder = $db->table('s_alunos a');
        $builder->join('p_especialidade e', 'e.id_especialidade = a.id_especialidade');



        return view('alunos/lista_alunos', [
			'alunos' => $this->alunosModel->paginate(10),
			'pager' => $this->alunosModel->pager
		]);