app/Controllers/CertificadoController.php

SELECT *
FROM `s_alunos`
WHERE `id_aluno` = '1'
---
	 public function select_certificado($id_aluno = null)
	 {
	 	$db      = \Config\Database::connect();
		$builder = $db->table('s_alunos');



		$builder->where('id_aluno', $id_aluno);
		//$query['dados'] = $builder->get()->getResult();
		//$query = $builder->get();

		//$data['query']= $this->AlunosModel->get_user();

		$data['dados'] = $builder->get()->getRow();